micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_gpio.c
  /* get IO position */
  position = POSITION_VAL(GPIO_Pin);

  /* Get the IO advanced configuration */
  index = (position & 0x07u) * GPIO_ADVCFGRL_1_Pos;
  pRet_Init->Edge = ((GPIOx->ADVCFGR[position >> 3u]
                      & ((GPIO_ADVCFGRL_DE0 << index) | (GPIO_ADVCFGRL_INVCLK0 << index))) >> index);
  pRet_Init->Retime = ((GPIOx->ADVCFGR[position >> 3u] & (GPIO_ADVCFGRL_RET0 << index)) >> index);

  return HAL_OK;
}


/**
  * @brief  Configure GPIO delay on specified GPIO pin.
  * @param  GPIOx where x can be (A..H and N..Q)
  * @param  GPIO_Pin specifies the port bit to be written.
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @param  pDly_Init pointer to a GPIO_DelayTypeDef structure that contains
  *         the delay configuration information for the specified GPIO peripheral.
  * @retval None
  */
void HAL_GPIO_SetDelay(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, const GPIO_DelayTypeDef *pDly_Init)
{
  uint32_t position = 0x00u;
  uint32_t iocurrent;
  uint32_t temp;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  assert_param(IS_GPIO_DELAY(pDly_Init->Delay));
  assert_param(IS_GPIO_PATH(pDly_Init->Path));

  /* Configure the port pins */
  while ((GPIO_Pin >> position) != 0x00u)
  {
    /* Get current io position */
    iocurrent = (GPIO_Pin) & (1uL << position);

    if (iocurrent != 0x00u)
    {
      /* Configure the IO Delay path */
      temp = GPIOx->ADVCFGR[position >> 3u];
      temp &= ~(GPIO_ADVCFGRL_DLYPATH0 << ((position & 0x07u) * GPIO_ADVCFGRL_1_Pos));
      temp |= (pDly_Init->Path << ((position & 0x07u) * GPIO_ADVCFGRL_1_Pos));
      GPIOx->ADVCFGR[position >> 3u] = temp;

      /* Configure the IO Delay */
      temp = GPIOx->DELAYR[position >> 3u];
      temp &= ~(GPIO_DELAYRL_DLY0_Msk << ((position & 0x07u) * GPIO_ADVCFGRL_1_Pos));
      temp |= (pDly_Init->Delay << ((position & 0x07u) * GPIO_ADVCFGRL_1_Pos));
      GPIOx->DELAYR[position >> 3u] = temp;
    }
    position++;
  }
}

/**
  * @brief  Get GPIO delay configuration on specified GPIO pin.
  * @param  GPIOx where x can be (A..H and N..Q)
  * @param  GPIO_Pin specifies the port bit to read.
  *         This parameter can be GPIO_PIN_x where x can be (0..15).
  * @param  pDly_Init pointer to the return GPIO_DelayTypeDef structure that contains the delay information
  * @retval HAL Status
  */
HAL_StatusTypeDef HAL_GPIO_GetDelay(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, GPIO_DelayTypeDef *pDly_Init)
{
  uint32_t position;
  uint32_t index;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_SINGLE_PIN(GPIO_Pin));

  /* Check null pointer */
  if (pDly_Init == NULL)
  {
    return HAL_ERROR;
  }

  /* get IO position */
  position = POSITION_VAL(GPIO_Pin);

  /* Get the IO advanced configuration */
  index = (position & 0x07u) * GPIO_ADVCFGRL_1_Pos;
  pDly_Init->Delay = ((GPIOx->DELAYR[position >> 3u] & (GPIO_DELAYRL_DLY0_Msk << index)) >> index);
  pDly_Init->Path = ((GPIOx->ADVCFGR[position >> 3u] & (GPIO_ADVCFGRL_DLYPATH0 << index)) >> index);

  return HAL_OK;
}

/**
  * @brief  Handle EXTI interrupt request.
  * @param  GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
void HAL_GPIO_EXTI_IRQHandler(uint16_t GPIO_Pin)
{
  /* EXTI line interrupt detected */
  if (__HAL_GPIO_EXTI_GET_RISING_IT(GPIO_Pin) != 0x00u)
  {
    __HAL_GPIO_EXTI_CLEAR_RISING_IT(GPIO_Pin);
    HAL_GPIO_EXTI_Rising_Callback(GPIO_Pin);
  }

  if (__HAL_GPIO_EXTI_GET_FALLING_IT(GPIO_Pin) != 0x00u)
  {
    __HAL_GPIO_EXTI_CLEAR_FALLING_IT(GPIO_Pin);
    HAL_GPIO_EXTI_Falling_Callback(GPIO_Pin);
  }
}

/**
  * @brief  EXTI line rising detection callback.
  * @param  GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
__weak void HAL_GPIO_EXTI_Rising_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Rising_Callback could be implemented in the user file
   */
}

/**
  * @brief  EXTI line falling detection callback.
  * @param  GPIO_Pin Specifies the port pin connected to corresponding EXTI line.
  * @retval None
  */
__weak void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(GPIO_Pin);

  /* NOTE: This function should not be modified, when the callback is needed,
           the HAL_GPIO_EXTI_Falling_Callback could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup GPIO_Exported_Functions_Group3 IO attributes management functions
  *  @brief GPIO attributes management functions.
  *
@verbatim
 ===============================================================================
                       ##### IO attributes functions #####
 ===============================================================================

@endverbatim
  * @{
  */

#if defined (CPU_IN_SECURE_STATE)

/**
  * @brief  Lock security and privilege configuration of several pins for a dedicated port.
  * @note   When the lock sequence has been applied on a port bit, the value of this port bit can no longer
  *         be modified until the next reset. Set sequence only available in secure and privilege.
  * @note   Each lock bit freezes a security configuration register (control and alternate function registers).
  * @param  GPIOx GPIO Port
  * @param  GPIO_Pin specifies the port bit to be locked.
  *         This parameter can be any combination of GPIO_Pin_x where x can be (0..15).
  * @retval None
  */
void HAL_GPIO_LockPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin)
{

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));

  /* Lock the pins */
  GPIOx->RCFGLOCKR = (uint32_t)GPIO_Pin;
}

/**
  * @brief  Get lock security and privilege configuration of several pins for a dedicated port.
  * @param  GPIOx GPIO Port
  * @retval Lock status for all pins. Bitx are set to 1 for pinx locked, otherwise 0.
  */
uint32_t HAL_GPIO_GetLockPinAttributes(const GPIO_TypeDef *GPIOx)
{

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));

  /* Lock the pins */
  return (GPIOx->RCFGLOCKR);

