micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_gpio.c
}

#endif /* CPU_IN_SECURE_STATE */

/**
  * @brief  Configure the GPIO pins attributes.
  * @note   Set a pin to secure is only available in secure and privilege
  *         Set a pin to privilege is only available in privilege
  * @param  GPIOx where x can be (A..H and N..Q) to select the GPIO peripheral for STM32N6xx family
  * @param  GPIO_Pin : GPIO_Pin specifies the pin(s) to configure the secure/privilege attribute
  * @param  PinAttributes: PinAttributes can be one or a combination of the following values :
  *            @arg @ref GPIO_PIN_PRIV         Privileged-only access
  *            @arg @ref GPIO_PIN_NPRIV        Privileged/Non-privileged access
  *            @arg @ref GPIO_PIN_SEC          Secure-only access
  *            @arg @ref GPIO_PIN_NSEC         Secure/Non-secure access
  * @retval None.
  */
void HAL_GPIO_ConfigPinAttributes(GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes)
{
#if defined CPU_IN_SECURE_STATE
  uint32_t sec;
#endif /* CPU_IN_SECURE_STATE */
  uint32_t priv;

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_PIN(GPIO_Pin));
  assert_param(IS_GPIO_PIN_ATTRIBUTES(PinAttributes));

#if defined CPU_IN_SECURE_STATE
  /* Configure the port pins */
  sec = GPIOx->SECCFGR;
  if ((PinAttributes & GPIO_PIN_SEC) == GPIO_PIN_SEC)
  {
    sec |= (uint32_t)GPIO_Pin;
  }
  else if ((PinAttributes & GPIO_PIN_NSEC) == GPIO_PIN_NSEC)
  {
    sec &= ~((uint32_t)GPIO_Pin);
  }
  else
  {
    /* do nothing */
  }
  GPIOx->SECCFGR = sec;
#endif /* CPU_IN_SECURE_STATE */

  priv = GPIOx->PRIVCFGR;
  if ((PinAttributes & GPIO_PIN_PRIV) == GPIO_PIN_PRIV)
  {
    priv |= (uint32_t)GPIO_Pin;
  }
  else if ((PinAttributes & GPIO_PIN_NPRIV) == GPIO_PIN_NPRIV)
  {
    priv &= ~((uint32_t)GPIO_Pin);
  }
  else
  {
    /* do nothing */
  }

  GPIOx->PRIVCFGR = priv;
}

/**
  * @brief  Get the GPIO pins attributes.
  * @param  GPIOx where x can be (A..H and N..Q) to select the GPIO peripheral for STM32N6xx family
  * @param  GPIO_Pin specifies the port bit to read.
  *         This parameter can be GPIO_PIN_x where x can be (0..15).
  * @param  pPinAttributes: pPinAttributes pointer to return the pin attributes.
  * @retval HAL Status.
  */
HAL_StatusTypeDef HAL_GPIO_GetConfigPinAttributes(const GPIO_TypeDef *GPIOx, uint16_t GPIO_Pin,
                                                  uint32_t *pPinAttributes)
{

  /* Check the parameters */
  assert_param(IS_GPIO_ALL_INSTANCE(GPIOx));
  assert_param(IS_GPIO_SINGLE_PIN(GPIO_Pin));

  /* Check null pointer */
  if (pPinAttributes == NULL)
  {
    return HAL_ERROR;
  }

  if ((GPIOx->SECCFGR & GPIO_Pin) != 0x00U)
  {
    *pPinAttributes = GPIO_PIN_SEC;
  }
  else
  {
    *pPinAttributes = GPIO_PIN_NSEC;
  }

  if ((GPIOx->PRIVCFGR & GPIO_Pin) != 0x00U)
  {
    *pPinAttributes |= GPIO_PIN_PRIV;
  }
  else
  {
    *pPinAttributes |= GPIO_PIN_NPRIV;
  }

  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_GPIO_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
